Avnet/mcore_sdk_8ulp/boards/evkmimx8ulp/multicore_examples/rpmsg_lite_str_echo_rtos/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: AH18, peripheral: FLEXSPI0, signal: flexspi_a_ss0_b, pin_signal: PTC5, DSE: HIDRIVE}
  - {pin_num: AE18, peripheral: FLEXSPI0, signal: flexspi_a_sclk, pin_signal: PTC6, DSE: HIDRIVE}
  - {pin_num: AF18, peripheral: FLEXSPI0, signal: flexspi_a_dqs, pin_signal: PTC0, PE: ENABLED, DSE: HIDRIVE}
  - {pin_num: AJ16, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 7', pin_signal: PTC1, DSE: HIDRIVE}
  - {pin_num: AE17, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 6', pin_signal: PTC2, DSE: HIDRIVE}
  - {pin_num: AJ18, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 5', pin_signal: PTC3, DSE: HIDRIVE}
  - {pin_num: AF17, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 4', pin_signal: PTC4, DSE: HIDRIVE}
  - {pin_num: AH19, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 3', pin_signal: PTC7, DSE: HIDRIVE}
  - {pin_num: AD18, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 2', pin_signal: PTC8, DSE: HIDRIVE}
  - {pin_num: AJ20, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 1', pin_signal: PTC9, DSE: HIDRIVE}
  - {pin_num: AH22, peripheral: FLEXSPI0, signal: 'flexspi_a_data, 0', pin_signal: PTC10, DSE: HIDRIVE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSpiFlashPins(void) {                                /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTC0_FLEXSPI0_A_DQS, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC0_FLEXSPI0_A_DQS,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC1_FLEXSPI0_A_DATA7, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC1_FLEXSPI0_A_DATA7,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC10_FLEXSPI0_A_DATA0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC10_FLEXSPI0_A_DATA0,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC2_FLEXSPI0_A_DATA6, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC2_FLEXSPI0_A_DATA6,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC3_FLEXSPI0_A_DATA5, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC3_FLEXSPI0_A_DATA5,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC4_FLEXSPI0_A_DATA4, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC4_FLEXSPI0_A_DATA4,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC5_FLEXSPI0_A_SS0_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC5_FLEXSPI0_A_SS0_B,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC6_FLEXSPI0_A_SCLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC6_FLEXSPI0_A_SCLK,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC7_FLEXSPI0_A_DATA3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC7_FLEXSPI0_A_DATA3,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC8_FLEXSPI0_A_DATA2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC8_FLEXSPI0_A_DATA2,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC9_FLEXSPI0_A_DATA1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC9_FLEXSPI0_A_DATA1,
                        IOMUXC_PCR_DSE_MASK);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMikroBusPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMikroBusPins(void) {                         /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTB2_PTB2,   0U); /* #01 AN   */
    IOMUXC_SetPinMux(IOMUXC_PTB14_PTB14, 0U); /* #02 RST  */
    IOMUXC_SetPinMux(IOMUXC_PTB6_PTB6,   0U); /* #03 CS   */
    IOMUXC_SetPinMux(IOMUXC_PTB5_PTB5,   0U); /* #04 SCK  */
    IOMUXC_SetPinMux(IOMUXC_PTB4_PTB4,   0U); /* #05 MISO */
    IOMUXC_SetPinMux(IOMUXC_PTB3_PTB3,   0U); /* #06 MOSI */

    /*      #07: 3.3v   #08: GND        */
    /*      #09: 5v     #10: GND        */
    /*  #11(SDA), #12(SCL) -> DA7212    */

    IOMUXC_SetPinMux(IOMUXC_PTA18_PTA18, 0U); /* #13 TXD   */
    IOMUXC_SetPinMux(IOMUXC_PTA15_PTA15, 0U); /* #14 RXD   */
    IOMUXC_SetPinMux(IOMUXC_PTB12_PTB12, 0U); /* #15 INT   */
    IOMUXC_SetPinMux(IOMUXC_PTA8_PTA8,   0U); /* #16 PWM   */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPdmPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: A9,  peripheral: MICFIL0, signal: 'micfil_clk,  01', pin_signal: PTB0}
  - {pin_num: B10, peripheral: MICFIL0, signal: 'micfil_data, 01', pin_signal: PTB1, PS: UP, PE: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPmicI2cPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPdmPins(void) {                         /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTB0_MICFIL0_CLK01, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTB1_MICFIL0_DATA01, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB1_MICFIL0_DATA01,
                        IOMUXC_PCR_PE_MASK |
                        IOMUXC_PCR_PS_MASK);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
